# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [12]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [13]:
# your code here

#### Print `temp`.

In [14]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [15]:
# your code here

In [16]:
"""
your comments here
"""

'\nyour comments here\n'

#### Select the rows where state is New York.

In [17]:
# your code here

#### What is the average temperature of cities in New York?

In [18]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [19]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [20]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [21]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [22]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [64]:
# your code here
df = pd.read_csv("Employee.csv")
df

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [24]:
# your code here

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 632.0+ bytes

In [25]:
"""
your comments here
"""
#Categorical data is object type, numeric is int 64

'\nyour comments here\n'

#### What's the average salary in this company?

In [26]:
# your code here
df["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [27]:
# your code here
df["Salary"].max()

70

#### What's the lowest salary?

In [28]:
# your code here
df["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [60]:
# your code here

df_min_sal = df[df["Salary"] == df["Salary"].min()]
print(df_min_sal)

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [62]:
# your code here

df_empl = df[df["Name"] == 'David']
display(df_empl)

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [63]:
# your code here

df_empl["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [66]:
# your code here
df_jobs = df[df["Title"] == "associate"]
df_jobs

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [68]:
# Method 1
# your code here

df.loc[:2]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [69]:
# Method 2
# your code here

df.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [70]:
# your code here

df_jobs = df[(df["Title"] == "associate")&(df["Salary"] > 55)]
df_jobs

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [73]:
# your code here

gr_df = df.groupby(["Years"]).agg({"Salary":"mean"})

gr_df

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [74]:
# your code here
gr_df = df.groupby(["Title"]).agg({"Salary":"mean"})

gr_df

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [75]:
# your code here

df["Salary"].describe()

count     9.000000
mean     48.888889
std      16.541194
min      30.000000
25%      35.000000
50%      55.000000
75%      60.000000
max      70.000000
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [76]:
# your code here

gr_sal_df = df.groupby(["Gender"]).agg({"Salary":"mean"})

gr_sal_df

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [79]:
# your code here

df_dep = df.groupby(["Department"]).describe()

df_dep

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

In [83]:
diff_sal_df = df.groupby(["Department"]).agg({"Salary":["max","min"]})

diff_sal_df

           Salary
              max min
Department
HR             70  30
IT             70  30
Sales          55  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [90]:
calculate_diff = lambda x: x.max() - x.min()

min_max_diff = df.groupby("Department")["Salary"].apply(calculate_diff).reset_index(name='min_max_diff')
min_max_diff

  Department  min_max_diff
0         HR            40
1         IT            40
2      Sales             0

In [80]:
double = lambda x: x*2
print(double(5))

10

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [42]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [43]:
# your code here

In [44]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [45]:
# your code here

#### What are the highest and lowest purchase prices?

In [46]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [47]:
# your code here

#### How many customers do we have in Spain?

In [48]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [49]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [50]:
# your code here

#### Select all free orders.

In [51]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [52]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [53]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [54]:
# your code here

#### Select all orders made in the month of August.

In [55]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [56]:
# your code here

#### What's the  average amount of money spent by country?

In [57]:
# your code here

#### What's the most expensive item?

In [58]:
# your code here

#### What is the average amount spent per year?

In [59]:
# your code here